ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/device/TOOLCHAIN_IAR/startup_TMPM46B.S
                PUBWEAK INTAD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTAD_IRQHandler
                B       INTAD_IRQHandler

                PUBWEAK INTAES_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTAES_IRQHandler
                B       INTAES_IRQHandler

                PUBWEAK INTSHA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSHA_IRQHandler
                B       INTSHA_IRQHandler

                PUBWEAK INTMLA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMLA_IRQHandler
                B       INTMLA_IRQHandler

                PUBWEAK INTESG_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTESG_IRQHandler
                B       INTESG_IRQHandler

                PUBWEAK INTSNFCSEQ_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSNFCSEQ_IRQHandler
                B       INTSNFCSEQ_IRQHandler

                PUBWEAK INTSNFCPRTAE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSNFCPRTAE_IRQHandler
                B       INTSNFCPRTAE_IRQHandler

                PUBWEAK INTSNFCPRTCE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSNFCPRTCE_IRQHandler
                B       INTSNFCPRTCE_IRQHandler

                PUBWEAK INTSNFCFAIL_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSNFCFAIL_IRQHandler
                B       INTSNFCFAIL_IRQHandler

                PUBWEAK INTMTEMG0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTEMG0_IRQHandler
                B       INTMTEMG0_IRQHandler

                PUBWEAK INTMTPTB00_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTPTB00_IRQHandler
                B       INTMTPTB00_IRQHandler

                PUBWEAK INTMTPTB01_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTPTB01_IRQHandler
                B       INTMTPTB01_IRQHandler

                PUBWEAK INTMTCAP00_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP00_IRQHandler
                B       INTMTCAP00_IRQHandler

                PUBWEAK INTMTCAP01_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP01_IRQHandler
                B       INTMTCAP01_IRQHandler

                PUBWEAK INTMTEMG1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTEMG1_IRQHandler
                B       INTMTEMG1_IRQHandler

                PUBWEAK INTMTPTB10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTPTB10_IRQHandler
                B       INTMTPTB10_IRQHandler

                PUBWEAK INTMTPTB11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTPTB11_IRQHandler
                B       INTMTPTB11_IRQHandler

                PUBWEAK INTMTCAP10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP10_IRQHandler
                B       INTMTCAP10_IRQHandler

                PUBWEAK INTMTCAP11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP11_IRQHandler
                B       INTMTCAP11_IRQHandler

                PUBWEAK INTMTEMG2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTEMG2_IRQHandler
                B       INTMTEMG2_IRQHandler

                PUBWEAK INTMTPTB20_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTPTB20_IRQHandler
                B       INTMTPTB20_IRQHandler

                PUBWEAK INTMTTTB21_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTTB21_IRQHandler
                B       INTMTTTB21_IRQHandler

                PUBWEAK INTMTCAP20_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP20_IRQHandler
                B       INTMTCAP20_IRQHandler

                PUBWEAK INTMTCAP21_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP21_IRQHandler
                B       INTMTCAP21_IRQHandler

                PUBWEAK INTMTEMG3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTEMG3_IRQHandler
                B       INTMTEMG3_IRQHandler

                PUBWEAK INTMTPTB30_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTPTB30_IRQHandler
                B       INTMTPTB30_IRQHandler

                PUBWEAK INTMTTTB31_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTTTB31_IRQHandler
                B       INTMTTTB31_IRQHandler

                PUBWEAK INTMTCAP30_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP30_IRQHandler
                B       INTMTCAP30_IRQHandler

                PUBWEAK INTMTCAP31_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTMTCAP31_IRQHandler
                B       INTMTCAP31_IRQHandler

                PUBWEAK INTTB0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB0_IRQHandler
                B       INTTB0_IRQHandler

                PUBWEAK INTCAP00_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP00_IRQHandler
                B       INTCAP00_IRQHandler

                PUBWEAK INTCAP01_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP01_IRQHandler
                B       INTCAP01_IRQHandler

                PUBWEAK INTTB1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB1_IRQHandler
                B       INTTB1_IRQHandler

                PUBWEAK INTCAP10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP10_IRQHandler
                B       INTCAP10_IRQHandler

                PUBWEAK INTCAP11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP11_IRQHandler
                B       INTCAP11_IRQHandler

                PUBWEAK INTTB2_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB2_IRQHandler
                B       INTTB2_IRQHandler

                PUBWEAK INTCAP20_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP20_IRQHandler
                B       INTCAP20_IRQHandler

                PUBWEAK INTCAP21_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP21_IRQHandler
                B       INTCAP21_IRQHandler

                PUBWEAK INTTB3_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB3_IRQHandler
                B       INTTB3_IRQHandler

                PUBWEAK INTCAP30_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP30_IRQHandler
                B       INTCAP30_IRQHandler

                PUBWEAK INTCAP31_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP31_IRQHandler
                B       INTCAP31_IRQHandler

