ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/device/TOOLCHAIN_IAR/startup_TMPM46B.S
                PUBWEAK INTTB4_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB4_IRQHandler
                B       INTTB4_IRQHandler

                PUBWEAK INTCAP40_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP40_IRQHandler
                B       INTCAP40_IRQHandler

                PUBWEAK INTCAP41_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP41_IRQHandler
                B       INTCAP41_IRQHandler

                PUBWEAK INTTB5_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB5_IRQHandler
                B       INTTB5_IRQHandler

                PUBWEAK INTCAP50_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP50_IRQHandler
                B       INTCAP50_IRQHandler

                PUBWEAK INTCAP51_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP51_IRQHandler
                B       INTCAP51_IRQHandler

                PUBWEAK INTTB6_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB6_IRQHandler
                B       INTTB6_IRQHandler

                PUBWEAK INTCAP60_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP60_IRQHandler
                B       INTCAP60_IRQHandler

                PUBWEAK INTCAP61_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP61_IRQHandler
                B       INTCAP61_IRQHandler

                PUBWEAK INTTB7_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB7_IRQHandler
                B       INTTB7_IRQHandler

                PUBWEAK INTCAP70_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP70_IRQHandler
                B       INTCAP70_IRQHandler

                PUBWEAK INTCAP71_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP71_IRQHandler
                B       INTCAP71_IRQHandler

                PUBWEAK INTRTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRTC_IRQHandler
                B       INTRTC_IRQHandler

                PUBWEAK INTDMAA_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAA_IRQHandler
                B       INTDMAA_IRQHandler

                PUBWEAK INTDMAB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAB_IRQHandler
                B       INTDMAB_IRQHandler

                PUBWEAK INTDMAC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAC_IRQHandler
                B       INTDMAC_IRQHandler

                PUBWEAK INTDMACTC8_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACTC8_IRQHandler
                B       INTDMACTC8_IRQHandler

                PUBWEAK INTDMACTC9_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACTC9_IRQHandler
                B       INTDMACTC9_IRQHandler

                PUBWEAK INTDMACTC10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACTC10_IRQHandler
                B       INTDMACTC10_IRQHandler

                PUBWEAK INTDMACTC11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACTC11_IRQHandler
                B       INTDMACTC11_IRQHandler

                PUBWEAK INTDMAAERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAAERR_IRQHandler
                B       INTDMAAERR_IRQHandler

                PUBWEAK INTDMABERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMABERR_IRQHandler
                B       INTDMABERR_IRQHandler

                PUBWEAK INTDMACERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACERR_IRQHandler
                B       INTDMACERR_IRQHandler

                PUBWEAK INTFLRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLRDY_IRQHandler
                B       INTFLRDY_IRQHandler

                END
